In [22]:
import pandas as pd
import numpy as np

In [23]:
num = pd.Series([5,6,7,8,9,10])
num

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [24]:
num = pd.Series([5,6,7,8,9,10], name = "Numbers") #needs "name", doesn't work without it
num

0     5
1     6
2     7
3     8
4     9
5    10
Name: Numbers, dtype: int64

In [25]:
type(num)

pandas.core.series.Series

In [26]:
num.index

RangeIndex(start=0, stop=6, step=1)

In [27]:
num.values

array([ 5,  6,  7,  8,  9, 10])

In [28]:
num[2] #indexing

7

In [29]:
# Explicitly defined Indexing

sale = pd.Series([6000, 5000, 45000, 23000, 500, 2000,10000], index = ['Cookies', 'Bananas', 'Chocolate', 'Candy', 'Soup', 'Gummies', 'Oranges'])

sale

Cookies       6000
Bananas       5000
Chocolate    45000
Candy        23000
Soup           500
Gummies       2000
Oranges      10000
dtype: int64

In [30]:
sale.index

Index(['Cookies', 'Bananas', 'Chocolate', 'Candy', 'Soup', 'Gummies',
       'Oranges'],
      dtype='object')

In [31]:
sale[2]

45000

In [32]:
sale['Chocolate']

45000

In [33]:
sale['Chocolate'] = 50000

In [34]:
sale

Cookies       6000
Bananas       5000
Chocolate    50000
Candy        23000
Soup           500
Gummies       2000
Oranges      10000
dtype: int64

In [35]:
sale.Chocolate

50000

In [36]:
# sale['Chocolate'] and sale.Chocolate have what difference?

In [37]:
filter = sale >= 20000
filter

Cookies      False
Bananas      False
Chocolate     True
Candy         True
Soup         False
Gummies      False
Oranges      False
dtype: bool

In [38]:
sale[filter] #ok for variables

Chocolate    50000
Candy        23000
dtype: int64

In [39]:
"Mochi" in sale

False

In [40]:
"Cookies" in sale

True

In [43]:
sale.index

Index(['Cookies', 'Bananas', 'Chocolate', 'Candy', 'Soup', 'Gummies',
       'Oranges'],
      dtype='object')

In [44]:
type(sale)

pandas.core.series.Series

In [ ]:
# Create a filter to filter data, use original series name followed by the filter Og_name[filter]

In [21]:
## SERIES - each element must have a unique index, name, values

In [ ]:
## A dataframe is a collection of series

In [45]:
data = {'state': ['California','Ohio','New York','Texas','Washington'],
        'year':[2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
data

{'state': ['California', 'Ohio', 'New York', 'Texas', 'Washington'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [47]:
a = pd.DataFrame(data)
a

        state  year  pop
0  California  2000  1.5
1        Ohio  2001  1.7
2    New York  2002  3.6
3       Texas  2001  2.4
4  Washington  2002  2.9

In [48]:
type(a)

pandas.core.frame.DataFrame

In [49]:
a.columns

Index(['state', 'year', 'pop'], dtype='object')

In [51]:
a.index

RangeIndex(start=0, stop=5, step=1)

In [52]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   5 non-null      object
 1   year    5 non-null      int64
 2   pop     5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [54]:
a.describe()

             year       pop
count     5.00000  5.000000
mean   2001.20000  2.420000
std       0.83666  0.864292
min    2000.00000  1.500000
25%    2001.00000  1.700000
50%    2001.00000  2.400000
75%    2002.00000  2.900000
max    2002.00000  3.600000

In [55]:
## Select df column, using [] or .

In [56]:
a

        state  year  pop
0  California  2000  1.5
1        Ohio  2001  1.7
2    New York  2002  3.6
3       Texas  2001  2.4
4  Washington  2002  2.9

In [57]:
a['state']

0    California
1          Ohio
2      New York
3         Texas
4    Washington
Name: state, dtype: object

In [58]:
a['year']

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

In [59]:
a.state

0    California
1          Ohio
2      New York
3         Texas
4    Washington
Name: state, dtype: object

In [60]:
# Loading data

In [63]:
df = pd.read_csv('skyscrapers_2021a.csv')
df

,RANK,NAME,CITY,COMPLETION,Meters,FLOORS,MATERIAL,FUNCTION
0,1,Burj Khalifa,Dubai,2010,828 m,163.0,steel/concrete,office / residential / hotel
1,2,Shanghai Tower,Shanghai,2015,632 m,128.0,composite,hotel / office
2,3,Makkah Royal Clock Tower,Mecca,2012,601 m,120.0,steel/concrete,other / hotel
3,4,Ping An Finance Center,Shenzhen,2017,599.1 m,115.0,composite,office
4,5,Lotte World Tower,Seoul,2017,554.5 m,123.0,composite,hotel / residential / office / retail
...,...,...,...,...,...,...,...,...
95,95,Jinan Center Financial City A5-3,Jinan,2020,333 m,69.0,composite,hotel / office
96,97,The Address Residence - Fountain Views III,Dubai,2019,331.8 m,77.0,concrete,serviced apartments / hotel
97,98,Minsheng Bank Building,Wuhan,2008,331 m,68.0,steel,office
98,99,China World Tower,Beijing,2010,330 m,74.0,composite,hotel / office
99,99,Yuexiu Fortune Center Tower 1,Wuhan,2017,330 m,68.0,composite,office

In [64]:
df.head()

,RANK,NAME,CITY,COMPLETION,Meters,FLOORS,MATERIAL,FUNCTION
0,1,Burj Khalifa,Dubai,2010,828 m,163.0,steel/concrete,office / residential / hotel
1,2,Shanghai Tower,Shanghai,2015,632 m,128.0,composite,hotel / office
2,3,Makkah Royal Clock Tower,Mecca,2012,601 m,120.0,steel/concrete,other / hotel
3,4,Ping An Finance Center,Shenzhen,2017,599.1 m,115.0,composite,office
4,5,Lotte World Tower,Seoul,2017,554.5 m,123.0,composite,hotel / residential / office / retail

In [65]:
df.head(10)

,RANK,NAME,CITY,COMPLETION,Meters,FLOORS,MATERIAL,FUNCTION
0,1,Burj Khalifa,Dubai,2010,828 m,163.0,steel/concrete,office / residential / hotel
1,2,Shanghai Tower,Shanghai,2015,632 m,128.0,composite,hotel / office
2,3,Makkah Royal Clock Tower,Mecca,2012,601 m,120.0,steel/concrete,other / hotel
3,4,Ping An Finance Center,Shenzhen,2017,599.1 m,115.0,composite,office
4,5,Lotte World Tower,Seoul,2017,554.5 m,123.0,composite,hotel / residential / office / retail
5,6,One World Trade Center,New York City,2014,541.3 m,94.0,composite,office
6,7,Guangzhou CTF Finance Centre,Guangzhou,2016,530 m,111.0,composite,hotel / residential / office
7,7,Tianjin CTF Finance Centre,Tianjin,2019,530 m,97.0,composite,hotel / serviced apartments / office
8,9,CITIC Tower,Beijing,2018,527.7 m,109.0,composite,office
9,10,TAIPEI 101,Taipei,2004,508 m,101.0,composite,office

In [66]:
df.tail()

,RANK,NAME,CITY,COMPLETION,Meters,FLOORS,MATERIAL,FUNCTION
95,95,Jinan Center Financial City A5-3,Jinan,2020,333 m,69.0,composite,hotel / office
96,97,The Address Residence - Fountain Views III,Dubai,2019,331.8 m,77.0,concrete,serviced apartments / hotel
97,98,Minsheng Bank Building,Wuhan,2008,331 m,68.0,steel,office
98,99,China World Tower,Beijing,2010,330 m,74.0,composite,hotel / office
99,99,Yuexiu Fortune Center Tower 1,Wuhan,2017,330 m,68.0,composite,office

In [67]:
df.shape

(100, 8)

In [68]:
df.columns

Index(['RANK', 'NAME', 'CITY', 'COMPLETION', 'Meters', 'FLOORS', 'MATERIAL',
       'FUNCTION'],
      dtype='object')

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   RANK        100 non-null    int64
 1   NAME        100 non-null    object
 2   CITY        100 non-null    object
 3   COMPLETION  100 non-null    int64
 4   Meters      100 non-null    object
 5   FLOORS      99 non-null     float64
 6   MATERIAL    100 non-null    object
 7   FUNCTION    100 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 6.4+ KB

In [73]:
df['CITY'].value_counts()

Dubai               16
New York City        7
Shenzhen             7
Hong Kong            5
Chicago              5
Kuala Lumpur         4
Moscow               4
Guangzhou            4
Shanghai             4
Wuhan                4
Busan                3
Guiyang              3
Chongqing            3
Tianjin              3
Changsha             2
Nanning              2
Beijing              2
Dalian               2
Abu Dhabi            2
Nanjing              2
Wuxi                 1
Philadelphia         1
Kunming              1
Zhenjiang            1
Zhuhai               1
Kaohsiung            1
Los Angeles          1
Seoul                1
Shenyang             1
Kuwait City          1
Suzhou               1
Ho Chi Minh City     1
St. Petersburg       1
Mecca                1
Taipei               1
Jinan                1
Name: CITY, dtype: int64

In [74]:
df.head()

,RANK,NAME,CITY,COMPLETION,Meters,FLOORS,MATERIAL,FUNCTION
0,1,Burj Khalifa,Dubai,2010,828 m,163.0,steel/concrete,office / residential / hotel
1,2,Shanghai Tower,Shanghai,2015,632 m,128.0,composite,hotel / office
2,3,Makkah Royal Clock Tower,Mecca,2012,601 m,120.0,steel/concrete,other / hotel
3,4,Ping An Finance Center,Shenzhen,2017,599.1 m,115.0,composite,office
4,5,Lotte World Tower,Seoul,2017,554.5 m,123.0,composite,hotel / residential / office / retail

In [77]:
df.iloc[3,6]

'composite'

In [79]:
df.shape

(100, 8)

In [82]:
df.iloc[10:21,0:4]

    RANK                             NAME              CITY  COMPLETION
10    11  Shanghai World Financial Center          Shanghai        2008
11    12    International Commerce Centre         Hong Kong        2010
12    13               Central Park Tower     New York City        2020
13    14                    Lakhta Center    St. Petersburg        2019
14    15               Vincom Landmark 81  Ho Chi Minh City        2018
15    16            Changsha IFS Tower T1          Changsha        2018
16    17            Petronas Twin Tower 1      Kuala Lumpur        1998
17    17            Petronas Twin Tower 2      Kuala Lumpur        1998
18    19                       Suzhou IFS            Suzhou        2019
19    19                     Zifeng Tower           Nanjing        2010
20    21                 The Exchange 106      Kuala Lumpur        2019

In [84]:
df.iloc[[7,8,21,99,1],0:4]

    RANK                           NAME      CITY  COMPLETION
7      7     Tianjin CTF Finance Centre   Tianjin        2019
8      9                    CITIC Tower   Beijing        2018
21    22             Wuhan Center Tower     Wuhan        2019
99    99  Yuexiu Fortune Center Tower 1     Wuhan        2017
1      2                 Shanghai Tower  Shanghai        2015